<template>
  <div>
    <header-nav :navindex="1"></header-nav>
    <div class="container_box">
      <div class="container">
        <div class="box">
          <img :alt="project.h1"
               :src="require('~/assets/images/project' + project.id + '.jpg')">
        </div>
        <div class="container-inner">
          <h1>
            <strong>{{project.h1}}</strong>
          </h1>
          <hr />
          <p v-for="(textItem,
         index) in project.text"
             :key="index">
            {{index + 1}}、{{textItem}}
          </p>
        </div>
      </div>
    </div>
    <wuxi-bohr></wuxi-bohr>
  </div>
</template>
<script>
import HeaderNav from '~/components/HeaderNav'
import WuxiBohr from '~/components/home/WuxiBohr'

export default {
  head () {
    return {
      title: '产品中心 - 无锡玻尔'
    }
  },
  data () {
    return {
      productList: [{
        id: "01",
        h1: "汽车展厅钢化玻璃划痕",
        text: [
          "使用可调速角磨机和一号研磨片进行粗磨，注意研磨片要与玻璃贴平，可调速角磨机转速调整在2500到3000转左右；",
          "使用一号研磨片粗磨，无需加水，直接研磨，注意操作时力度适中、平稳有序。非钢化玻璃要控制玻璃温度不能过热，防止炸裂；",
          "一号粗磨完成，更换2号研磨片精磨，注意研磨范围要大于一号研磨区域，以控制变形；",
          "及时清理研磨片上的玻璃粉末，以保证研磨的最高效率；",
          "精磨结束，更换抛光片进行抛光；",
          "边加水，边抛光，随时观察抛光效果；",
          "抛光结束，完美如新！"
        ]
      },
      {
        id: "02",
        h1: "钢化玻璃划痕",
        text: [
          "修复前，属于严重玻璃划痕；",
          "蓝色4英寸研磨片粗磨；",
          "蓝色研磨片粗磨；",
          "绿色研磨片精磨；",
          "海绵抛光轮加抛光膏抛光；",
          "修复后，完美如新！"
        ]
      },
      {
        id: "03",
        h1: "厨具类钢化玻璃划痕",
        text: [
          "厨具类钢化玻璃划痕修复为例，深度的钢化玻璃划痕；",
          "通常在室内操作时做好防护，以免玻璃研磨出来的粉尘飘散，也能防止抛光膏飞溅。使用无痕纸胶带或美纹胶带，沿玻璃划痕修复处扩大一圈贴胶带做围堰；",
          "第一步使用粗磨片，研磨玻璃表面去除划痕，不仅研磨伤痕处，还要适当扩大研磨范围，把玻璃的形变量控制在最小范围，深度越深的划痕，所需要研磨的范围越大；",
          "第二步使用细磨片，研磨去除粗研磨痕迹，粗研磨后玻璃表面近乎平整，使用细研磨片研磨覆盖粗研磨的痕迹，简单说就是细研磨的范围要大于粗研磨的范围；",
          "第三步抛光，抛光恢复玻璃原有的光泽度和亮度，抛光时使用纯羊毛抛光盘，先用水预湿润，然后挤上适量的抛光膏，抛光时抛光膏中的液态成分会不断挥发，快干时喷水稀释即可;",
          "抛光结束后清洗干净玻璃表面，擦掉飘散的粉尘，一块完美如初的玻璃有展现在了面前，心情一定大好！"
        ]
      },
      {
        id: "04",
        h1: "钢化玻璃电焊烫伤",
        text: [
          "幕墙玻璃焊点修复；",
          "为了方便修复焊点，将要修复的范围在玻璃背面做上标记；",
          "焊点比较深，使用绿色研磨片把焊点研磨掉，研磨时间会比较长些，所有研磨工序要注意喷水；",
          "依次使用粉红色、蓝色、橙色研磨片进行研磨，下一道工序要比上一道工序的研磨面积大；",
          "在研磨区域涂抹适量的抛光膏，使用纯羊毛抛光盘进行抛光，抛光过程要注意喷水；",
          "幕墙玻璃焊点修复结束，准备清洁玻璃，完美如新！"
        ]
      },
      {
        id: "05",
        h1: "门窗玻璃划痕",
        text: [
          "修复前认真检查；",
          "对需要研磨的部位进行标记，属于深度划痕；",
          "修复划痕前，做好防护，避免水和抛光膏飞溅；",
          "绿色研磨片研磨结束，划痕已经消失；",
          "第二道工序使用粉红色研磨片精磨，研磨区域透明度要高于绿色研磨区域；",
          "第三道工序使用蓝色研磨片精磨，研磨区域透明度又比粉红色研磨区域高；",
          "最后一道研磨工序，使用橙色研磨片精磨，研磨区域已接近半透明；",
          "在研磨区域上涂抹适量的抛光膏，使用纯羊毛抛光盘进行抛光，注意喷水;",
          "修复后，完美如新！"
        ]
      },
      {
        id: "06",
        h1: "精装房玻璃划痕修",
        text: [
          "精装房玻璃划痕修复；",
          "划痕属于重度划痕，第一道工序使用绿色研磨片粗磨，所有研磨工序要注意喷水；",
          "粗磨结束后，依次使用粉红色、蓝色、橙色研磨片进行精磨；",
          "取适量抛光膏涂抹于研磨区域，配合纯羊毛抛光盘进行抛光，抛光过程注意喷水，雾状最佳；",
          "修复后，完美如新！"
        ]
      },
      {
        id: "07",
        h1: "汽车玻璃长条裂痕",
        text: [
          "选择市内施工，或者背阴处，同时加强遮挡；",
          "用指甲检查裂纹位置，清理破损部位；",
          "去除注胶管瓶口封豆，套上注胶管，注胶管需要略长于瓶嘴，形成一个凹腔；",
          "竖裂从低到高，横列从宽到窄顺序施工。从裂纹一段挤一滴修复液，从侧面观察直到裂纹因修复液进入而变淡后，再移动挤入第二滴，不能挤入太多，否则会堵住缝隙，导致空气无法排出而失败。如果遇到不渗透，可以通过挤压、轻轻弹击、打火机烘烤等促进渗透。渗透一段后，在修好位置滴上复液，贴上固化膜，可防止流失，修一段贴一段，直到全部修好；",
          "注胶时，倒置瓶子，轻轻压挤瓶身，使修复夜注满注胶管的凹处，将注胶管按压在裂缝一端，形成密封后挤压瓶身形成压力，将修复夜注入裂缝。",
          "确保渗透完毕后，将车移动到阳光处照晒20分钟，阴天60分钟或者用专用固化灯进行凝固；",
          "检查固化完成后，撕下固化莫，用刀片铲去表面残胶，完成修复修，完美如新！"
        ]
      },
      {
        id: "08",
        h1: "玻璃星型裂痕",
        text: [
          "清洁玻璃表层，先用棉签和纸巾将破损点的污染物清除，力度要适中，以免将破损点扩大；",
          "抽真空，将裂痕中的空气抽出；",
          "注胶，将树脂胶水注入裂痕中；",
          "使用紫外线灯固化树脂胶水；",
          "固化后将多余的树脂挂除；",
          "汽车挡风玻璃星型裂痕修复完毕，完美如新！"
        ]
      },
      {
        id: "09",
        h1: "玻璃牛眼型裂痕",
        text: [
          "清洁玻璃表层，先用棉签和纸巾将破损点的污染物清除，力度要适中，以免将破损点扩大；",
          "取一个纸杯，倒入少量水，把三个吸盘放入纸杯中，吸盘沾湿后取出吸附在三角架上，然后将三角架的中心孔对准撞击点。注意吸盘的方位，不要让清水流入裂痕中，将吸盘压牢，用来固定注胶头；",
          "准备注胶器头，然后将密封圈安装到注胶头螺纹端的孔内。安装好密封圈后将注胶头旋入三脚架中心孔中同时注意观察密封圈，当看到密封圈被压在玻璃上，而且发生轻微变形就可以停止了。对密封圈施加的压力不能过大，否则可能使原有的牛眼或星型裂痕加大，而力度过小会造成树脂外溢（而且无法抽真空）；",
          "旋转注胶头且密封圈与玻璃适当结合后，取出1毫升注射器，安装好针头；",
          "打开树脂胶水瓶，用1毫升注射器抽取适量树脂胶水然后注入到注胶头中（注入的胶水根据裂痕的大小不同而不同，一般0.05到0.3毫升不等）；",
          "抽真空：扶住注胶头，把注胶器插到注胶头六角中心孔内并拧紧。接下来扶住注胶器，把注胶器拉杆拉出直到拉杆底部的十字缺口与注胶器上标有“天津飞顺”的锁定挡板齐平，然后旋转45度，将拉杆卡住，然后在前挡风玻璃的背面观察撞击点，如果有气泡产生，说明注胶器正在抽真空。假如没有气泡产生，则要重复前面的步骤，直到有气泡产生。注意：如果重复多次抽真空都没有发现有气泡产生，请确认密封圈是否正对着玻璃上的撞击点，如果没有对准，请移动注胶器或者三角架进行校正。如果条件允许，可以使用带有加热功能的吹风机对被修复区域的反面玻璃进行加热, 这样可以加速缝隙内的气体排出；",
          "抽真空5~10分钟之后，观察撞击点再无气泡产生了，就可以进行注胶操作，注意:如果使用吹风机对玻璃进行加热，注胶前请等待玻璃冷却后再进行注胶；",
          "扶住注胶器，将注胶器拉杆回旋45度，让拉杆正对着凹槽，拉稳拉杆，缓慢收回注胶器筒内；",
          "注胶：扶住注胶头，把注胶器拧下来，将注胶器的拉杆拉出3毫米左右，再把注胶器拧回注胶头，扶住注胶器，把拉杆往下压，当拉杆顶部的十字缺口与注胶器上的锁定挡板齐平后将拉杆旋转45度使锁定挡板卡住拉杆，这时候开始注胶。在5至10分钟后用小手电观察玻璃背面的裂痕，看树脂是否完全填充所有破损部位。如果没有发现树脂在破损部位移动，则再抽真空，反复进行，直至树脂全部填充到破损部位。请注意：胶水注满裂痕后，在固化前，汽车前挡风玻璃必须避免受到任何的外力(如:手、肘压到玻璃上等)或者强烈的振动。",
          "注胶结束后，扶住注胶器，将注胶器拉杆回旋45度，使拉杆弹出并取下注胶器。用注射器吸出注胶头里的树脂，取下注胶头，用注射器回收流下来的树脂，以备下次使用。轻轻取下三角架，取出一张贴片，用注射器在贴片上面滴上一滴树脂，把贴片贴到裂痕修复的部位，注意:贴片与玻璃要贴合，不要存在气泡；",
          "将吸盘吸附到紫外线灯上，打开紫外线灯，放到离贴片一公分左右的位置上，进行固化照射。15分钟以后，移除紫外线灯，揭开贴片，固化完毕（若没有紫外线固化灯，可以在室内完成抽真空、注胶、贴片后将汽车开到日光下晒25-30分钟）；",
          "检查刀片刀锋部位是否工整清洁，将刀片刀锋垂直于固化好的玻璃上，由外向里单方向轻轻刮除固化后的树脂，注意用力均匀；",
          "刮除多余树脂后，破损点的部分会留下一处轻微的白色透明痕迹（或小白点），这属于正常现象；",
          "汽车前挡风玻璃牛眼裂痕修复完毕，完美如新！"
        ]
      },
      {
        id: "10",
        h1: "玻璃严重电焊炸伤修复",
        text: [
          "精装房玻璃划痕修复；",
          "划痕属于重度划痕，第一道工序使用绿色研磨片粗磨，所有研磨工序要注意喷水；",
          "粗磨结束后，依次使用粉红色、蓝色、橙色研磨片进行精磨；",
          "取适量抛光膏涂抹于研磨区域，配合纯羊毛抛光盘进行抛光，抛光过程注意喷水，雾状最佳；",
          "修复后，完美如新！"
        ]
      }],
      project: {
        id: "00",
        h1: "无锡玻尔",
        text: [
          "无锡玻尔金属门窗工程有限公司"
        ]
      }
    }
  },
  components: {
    HeaderNav,
    WuxiBohr
  },
  mounted () {
    if (isNaN(this.$route.query.id) || this.$route.query.id === '') {
      this.$router.push('/');
      return;
    }
    for (const key in this.productList) {
      if (this.productList.hasOwnProperty(key)) {
        const element = this.productList[key];
        if (this.$route.query.id == element.id) {
          this.project = element;
          break;
        }
      }
    }
  },
}
</script>
<style scoped>
.container {
  margin-top: 62px;
  display: flex;
}
.container-inner {
  background: #fff;
  padding: 20px;
  width: 60%;
  box-sizing: border-box;
}

.container h1 {
  font-size: 1.2rem;
  font-weight: bolder;
  margin-top: 0.83rem;
  margin-bottom: 0.83rem;
}
.container p {
  font-size: 0.6rem;
  line-height: 32px;
  color: #212529;
  text-align: left;
  margin-top: 0;
  text-indent: 2em;
}
.box {
  width: 40%;
  margin-top: 40px;
}
.box img {
  width: 100%;
  height: auto;
}
@media only screen and (max-width: 1200px) {
  .container {
    margin-top: 56px;
  }
}
@media only screen and (max-width: 992px) {
  .container {
    margin-top: 50px;
  }
  .container h1 {
    margin-top: 0.7rem;
    margin-bottom: 0.7rem;
  }
  .container p {
    line-height: 26px;
  }
}
@media only screen and (max-width: 768px) {
  .container h1 {
    margin-top: 0.75rem;
    margin-bottom: 0.75rem;
    line-height: 32px;
  }
  .container p {
    line-height: 24px;
  }
}
@media only screen and (max-width: 480px) {
  .container {
    margin-top: 46px;
    flex-direction: column;
  }
  .container-inner {
    width: 100%;
  }
  .box {
    width: 100%;
    margin-top: 0;
  }
  .container h1 {
    margin-top: 0.65rem;
    margin-bottom: 0.65rem;
  }
  .container p {
    line-height: 22px;
  }
}
</style>
